import os

BOT_TOKEN        = os.environ["BOT_TOKEN"]
GEMINI_API_KEY   = os.environ.get("GEMINI_API_KEY", "")
SHEET_ID         = os.environ["SHEET_ID"]
SHEET_NAME       = os.environ.get("SHEET_NAME", "الطلاب")
CREDENTIALS_FILE = os.environ.get("CREDENTIALS_FILE", "credentials.json")
ADMIN_ID         = int(os.environ.get("ADMIN_ID", "0"))

SPECIALIZATIONS = {
    "رئيسية": ["عام", "أزهر", "بكالوريا"],
    "بكالوريا": ["طب", "هندسة", "الاداب", "الاعمال"]
}

SUBJECTS = {
    "ث1": ["عربي", "انجليزي", "تاريخ", "علوم", "فلسفة", "رياضة", "فرنساوي", "برمجة"],
    "ث2": ["عربي", "انجليزي", "كيمياء", "فزياء", "برمجة", "محاسبة", "علم نفس", "ادارة اعمال", "فرنساوي", "رياضة", "تاريخ"],
    "ث3": ["عربي", "انجليزي", "كيمياء", "فزياء", "احياء", "رياضة", "احصاء", "تاريخ", "فرنساوي"]
}

TEACHERS = {
    "عربي":        ["ا/ احمد عبد القادر", "ا/ سيد عبد العاطي"],
    "كيمياء":      ["ا/ محمد صلاح"],
    "فزياء":       ["ا/ محمد الجوهري", "ا/ عمر عبد الفضيل", "ا/ محمد مختار"],
    "احياء":       ["ا/ محمد نور", "ا/ محمد علام", "ا/ علي نور"],
    "انجليزي":     ["ا/ حماده يوسف", "ا/ محمد صبحي"],
    "تاريخ":       ["ا/ ايمن شعبان", "ا/ رضا صلاح", "ا/ سمية محمود"],
    "رياضة":       ["ا/ مصطفي صابر", "ا/ ناصر سعد"],
    "احصاء":       ["ا/ مصطفي صابر"],
    "فرنساوي":     ["ا/ محمد رجب"],
    "برمجة":       ["م/ نور الدين", "م/ محمد ابراهيم"],
    "فلسفة":       ["ا/ احمد الليثي", "ا/ سمية محمود", "ا/ سارة مجدي"],
    "علوم":        [],
    "محاسبة":      [],
    "علم نفس":     [],
    "ادارة اعمال": [],
}

COLUMNS = ["الكود", "الاسم", "المنطقة", "التليفون", "ولي الأمر", "السنة الدراسية", "التخصص", "المواد", "المدرسين", "تاريخ التسجيل"]
